src/InformationRegisters/Scan_Обмен1БДОчередьПоОтправкеРеквизитов/Scan_Обмен1БДОчередьПоОтправкеРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_Обмен1БДОчередьПоОтправкеРеквизитов</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
      <types>CatalogRef.Scan_ТипыПродуктов</types>
      <types>Boolean</types>
      <types>CatalogRef.Scan_МаркиПродуктов</types>
      <types>CatalogRef.Scan_ЛокальныеСтатусыПродуктов</types>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
      <types>CatalogRef.Scan_Контрагенты</types>
      <types>String</types>
      <types>Date</types>
      <types>CatalogRef.Scan_ВидыТахографов</types>
      <types>Number</types>
      <types>CatalogRef.Scan_ТипыПродуктовЛогистика</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Scan_МестаХранения</types>
      <types>CatalogRef.Scan_АдресаХранения</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЗапроса</name>
    <type>
      <types>CatalogRef.Scan_ВидыЗапроса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
      <types>CatalogRef.Scan_Компании</types>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_ВидыЗапроса/Scan_ВидыЗапроса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ВидыЗапроса</name>
  <comment>Виды запросов в 1БД</comment>
  <predefined>
    <items>
      <name>AddUpdateUser</name>
      <description>AddUpdateUser</description>
    </items>
    <items>
      <name>CheckUserTokenIsOnline</name>
      <description>CheckUserTokenIsOnline</description>
    </items>
    <items>
      <name>CloseExchangeSession</name>
      <description>CloseExchangeSession</description>
    </items>
    <items>
      <name>CreateProduct</name>
      <description>CreateProduct</description>
    </items>
    <items>
      <name>CreateSOP</name>
      <description>CreateSOP</description>
    </items>
    <items>
      <name>GetAdditionalProperty</name>
      <description>GetAdditionalProperty</description>
    </items>
    <items>
      <name>GetChassis</name>
      <description>GetChassis</description>
    </items>
    <items>
      <name>GetCompany</name>
      <description>GetCompany</description>
    </items>
    <items>
      <name>GetContragents</name>
      <description>GetContragents</description>
    </items>
    <items>
      <name>GetDealers</name>
      <description>GetDealers</description>
    </items>
    <items>
      <name>GetEngines</name>
      <description>GetEngines</description>
    </items>
    <items>
      <name>GetEPTS</name>
      <description>GetEPTS</description>
    </items>
    <items>
      <name>GetEPTSstatement</name>
      <description>GetEPTSstatement</description>
    </items>
    <items>
      <name>GetListContragent</name>
      <description>GetListContragent</description>
    </items>
    <items>
      <name>GetListDogovorov</name>
      <description>GetListDogovorov</description>
    </items>
    <items>
      <name>GetListOfCategories</name>
      <description>GetListOfCategories</description>
    </items>
    <items>
      <name>GetListOfChassis</name>
      <description>GetListOfChassis</description>
    </items>
    <items>
      <name>GetListOfCommercialOffers</name>
      <description>GetListOfCommercialOffers</description>
    </items>
    <items>
      <name>GetListOfCompany</name>
      <description>GetListOfCompany</description>
    </items>
    <items>
      <name>GetListOfCompanyGroup</name>
      <description>GetListOfCompanyGroup</description>
    </items>
    <items>
      <name>GetListOfCompanyType</name>
      <description>GetListOfCompanyType</description>
    </items>
    <items>
      <name>GetListOfContragents</name>
      <description>GetListOfContragents</description>
    </items>
    <items>
      <name>GetListOfCooperationType</name>
      <description>GetListOfCooperationType</description>
    </items>
    <items>
      <name>GetListOfCostCenters</name>
      <description>GetListOfCostCenters</description>
    </items>
    <items>
      <name>GetListOfCountries</name>
      <description>GetListOfCountries</description>
    </items>
    <items>
      <name>GetListOfDealers</name>
      <description>GetListOfDealers</description>
    </items>
    <items>
      <name>GetListOfDealerType</name>
      <description>GetListOfDealerType</description>
    </items>
    <items>
      <name>GetListOfDeliveries</name>
      <description>GetListOfDeliveries</description>
    </items>
    <items>
      <name>GetListOfEngines</name>
      <description>GetListOfEngines</description>
    </items>
    <items>
      <name>GetListOfManufacturers</name>
      <description>GetListOfManufacturers</description>
    </items>
    <items>
      <name>GetListOfOptions</name>
      <description>GetListOfOptions</description>
    </items>
    <items>
      <name>GetListOfOrderToDelivery</name>
      <description>GetListOfOrderToDelivery</description>
    </items>
    <items>
      <name>GetListOfProduct</name>
      <description>GetListOfProduct</description>
    </items>
    <items>
      <name>GetListOfProductGroup</name>
      <description>GetListOfProductGroup</description>
    </items>
    <items>
      <name>GetListOfProductMark</name>
      <description>GetListOfProductMark</description>
    </items>
    <items>
      <name>GetListOfProductModel</name>
      <description>GetListOfProductModel</description>
    </items>
    <items>
      <name>GetListOfProductSubType</name>
      <description>GetListOfProductSubType</description>
    </items>
    <items>
      <name>GetListOfProductType</name>
      <description>GetListOfProductType</description>
    </items>
    <items>
      <name>GetListOfProductTypeSPORT</name>
      <description>GetListOfProductTypeSPORT</description>
    </items>
    <items>
      <name>GetListOfQuotation</name>
      <description>GetListOfQuotation</description>
    </items>
    <items>
      <name>GetListOfRegions</name>
      <description>GetListOfRegions</description>
    </items>
    <items>
      <name>GetListOfSOP</name>
      <description>GetListOfSOP</description>
    </items>
    <items>
      <name>GetListOfSpecifications</name>
      <description>GetListOfSpecifications</description>
    </items>
    <items>
      <name>GetListOfSpecificationType</name>
      <description>GetListOfSpecificationType</description>
    </items>
    <items>
      <name>GetListOfSpecificationView</name>
      <description>GetListOfSpecificationView</description>
    </items>
    <items>
      <name>GetListOfSpecificationViewType</name>
      <description>GetListOfSpecificationViewType</description>
    </items>
    <items>
      <name>GetListOfStatuses</name>
      <description>GetListOfStatuses</description>
    </items>
    <items>
      <name>GetManufacturers</name>
      <description>GetManufacturers</description>
    </items>
    <items>
      <name>GetOrderStatus</name>
      <description>GetOrderStatus</description>
    </items>
    <items>
      <name>GetOrderToDelivery</name>
      <description>GetOrderToDelivery</description>
    </items>
    <items>
      <name>GetProduct</name>
      <description>GetProduct</description>
    </items>
    <items>
      <name>GetProductCommercialOffers</name>
      <description>GetProductCommercialOffers</description>
    </items>
    <items>
      <name>GetProductGroup</name>
      <description>GetProductGroup</description>
    </items>
    <items>
      <name>GetProductMark</name>
      <description>GetProductMark</description>
    </items>
    <items>
      <name>GetProductModel</name>
      <description>GetProductModel</description>
    </items>
    <items>
      <name>GetProductSubType</name>
      <description>GetProductSubType</description>
    </items>
    <items>
      <name>GetProductType</name>
      <description>GetProductType</description>
    </items>
    <items>
      <name>GetQuotation</name>
      <description>GetQuotation</description>
    </items>
    <items>
      <name>GetSOP</name>
      <description>GetSOP</description>
    </items>
    <items>
      <name>GetSpecification</name>
      <description>GetSpecification</description>
    </items>
    <items>
      <name>GetSpecificationVersion</name>
      <description>GetSpecificationVersion</description>
    </items>
    <items>
      <name>GetSpecificationView</name>
      <description>GetSpecificationView</description>
    </items>
    <items>
      <name>GetTaskOfExecution</name>
      <description>GetTaskOfExecution</description>
    </items>
    <items>
      <name>GetUpdatesList</name>
      <description>GetUpdatesList</description>
    </items>
    <items>
      <name>GetUser</name>
      <description>GetUser</description>
    </items>
    <items>
      <name>OpenExchangeSession</name>
      <description>OpenExchangeSession</description>
    </items>
    <items>
      <name>SendProductActivityEvent</name>
      <description>SendProductActivityEvent</description>
    </items>
    <items>
      <name>SetAdditionalProperty</name>
      <description>SetAdditionalProperty</description>
    </items>
    <items>
      <name>SetChassis</name>
      <description>SetChassis</description>
    </items>
    <items>
      <name>SetLocation</name>
      <description>SetLocation</description>
    </items>
    <items>
      <name>SetOrderToDelivery</name>
      <description>SetOrderToDelivery</description>
    </items>
    <items>
      <name>SetProduct</name>
      <description>SetProduct</description>
    </items>
    <items>
      <name>SetProductPlace</name>
      <description>SetProductPlace</description>
    </items>
    <items>
      <name>SetPurchaseOrder</name>
      <description>SetPurchaseOrder</description>
    </items>
    <items>
      <name>SetPurchaseOrderApproval</name>
      <description>SetPurchaseOrderApproval</description>
    </items>
    <items>
      <name>SetSOP</name>
      <description>SetSOP</description>
    </items>
    <items>
      <name>SetTaskOfExecution</name>
      <description>SetTaskOfExecution</description>
    </items>
    <items>
      <name>StoreInfo</name>
      <description>StoreInfo</description>
    </items>
  </predefined>
  <attributes>
    <name>Запрос1СДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросПортала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОчищатьИсториюЗапроса</name>
    <comment>#18705</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/Scan_Обмен1БДОчередьПоОтправкеРеквизитов/ManagerModule.bsl
//rarus bonmak 15.08.2019 14576 ++

// Функция записи параметров в регистр сведений
// Параметры
//  ТекСсылка    – СправочникСсылка.Scan_ЗаказыНаЗавод – Заказ на завод,  СправочникСсылка.Scan_Изделия - Изделия
//  ВидЗапроса   – ПеречислениеСсылка.Scan_ВидыЗапроса
//  Реквизит     – строка, наименование реквизита
//  Значение     - булево, Справочники.Scan_ЛокальныеСтатусыЗаказовНаЗавод, число, строка, дата
// Возвращаемое значение:
//   Булево      – ошибка записи значения
Процедура ЗаписьЗначенияРегистраСведения(ТекСсылка, ВидЗапроса, Реквизит, Значение, НаДату = Неопределено, Пользователь = Неопределено) Экспорт		
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(ТекСсылка) Тогда
		Возврат;
	КонецЕсли;
	//rarus bonmak 21.08.2020 16210 ++
	//фВидЗапроса = Метаданные.Перечисления.Scan_ВидыЗапроса.ЗначенияПеречисления[Перечисления.Scan_ВидыЗапроса.Индекс(ВидЗапроса)].Имя; 
	фВидЗапроса = ВидЗапроса.ИмяПредопределенныхДанных;
	//rarus bonmak 21.08.2020 16210 --
	Если ВидЗапроса = Справочники.Scan_ВидыЗапроса.SetOrderToDelivery Тогда //rarus bonmak 21.08.2020 16210 изменено с перечисления на справочник 
		Если НЕ Scan_ПраваИНастройки.Scan_Право("РазрешитьОтправкуЛокальныхСтатусовЗаказовНаЗаводВ1БД") Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
		
	Если ВидЗапроса = Справочники.Scan_ВидыЗапроса.SetProduct ИЛИ	//rarus bonmak 21.08.2020 16210 изменено с перечисления на справочник
		ВидЗапроса = Справочники.Scan_ВидыЗапроса.SetAdditionalProperty Тогда	// rarus tenkam 29.04.2021 mantis 17659 + 
		
		// rarus vikhle 01.03.2022 m 18879 +++
		//Если НЕ ЗначениеЗаполнено(ТекСсылка.IDExternalSystemProduct) Тогда
		//	Возврат;	
		//КонецЕсли;
		//IDExternalSystem = ТекСсылка.IDExternalSystemProduct;
		
		Если ТипЗнч(ТекСсылка) = Тип("СправочникСсылка.Scan_Изделия") Тогда
			Если НЕ ЗначениеЗаполнено(ТекСсылка.IDExternalSystemProduct) Тогда
				Возврат;	
			Иначе
				IDExternalSystem = ТекСсылка.IDExternalSystemProduct;	
			КонецЕсли;
		Иначе
			IDExternalSystem = ТекСсылка.IDExternalSystem; 	
		КонецЕсли;
		// rarus vikhle 01.03.2022 m 18879 ---
		
	ИначеЕсли ВидЗапроса = Справочники.Scan_ВидыЗапроса.SetLocation Тогда //rarus bonmak 02.12.2019 14375 ++ //rarus bonmak 21.08.2020 16210 изменено с перечисления на справочник
		//Если НЕ ЗначениеЗаполнено(ТекСсылка.IDExternalSystemProduct) Тогда
		//	Возврат;	
		//КонецЕсли;
		IDExternalSystem = ТекСсылка.IDExternalSystem;
		//rarus bonmak 02.12.2019 14375 --
	ИначеЕсли ВидЗапроса = Справочники.Scan_ВидыЗапроса.CreateProduct ИЛИ	//rarus bonmak 18.05.2020 14375 ++ //rarus bonmak 21.08.2020 16210 изменено с перечисления на справочник
		ВидЗапроса = Справочники.Scan_ВидыЗапроса.CreateSOP Тогда 
		IDExternalSystem = "";
		//rarus bonmak 18.05.2020 14375 --
	Иначе
		Если НЕ ЗначениеЗаполнено(ТекСсылка.IDExternalSystem) Тогда
			Возврат;	
		КонецЕсли;
		IDExternalSystem = ТекСсылка.IDExternalSystem;
	КонецЕсли;
		
	Если НаДату = Неопределено Тогда
		ДатаЗаписи = ТекущаяДата();
	Иначе
		ДатаЗаписи = НаДату;
	КонецЕсли; 
	
	Если Пользователь = Неопределено Тогда
		ТекПользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	Иначе
		ТекПользователь = Пользователь;
	КонецЕсли;
	//Получим текст запроса
	
	ИмяСобытияЖурналаРегистрации = "Веб-сервис." + фВидЗапроса;	
	СтруктураПараметров = Scan_ВебСервисы.ПолучитьСтруктуруПараметровМетода(фВидЗапроса ,Ложь);
	Если ВидЗапроса <> Справочники.Scan_ВидыЗапроса.CreateProduct Тогда //rarus bonmak 18.05.2020 14375 добавил условие //rarus bonmak 21.08.2020 16210 изменено с перечисления на справочник
		СтруктураПараметров.Вставить("GUID", IDExternalSystem);
	КонецЕсли;
		
	// rarus tenkam 12.11.2020 mantis 16181 +++
	Если ВидЗапроса = Справочники.Scan_ВидыЗапроса.CreateSOP ИЛИ
		 ВидЗапроса = Справочники.Scan_ВидыЗапроса.SetSOP Тогда
		СтруктураПараметров = Scan_ВебСервисыРазборОтветов.СОППолучитьСтруктуруДанныхДляОтправкив1БД(ТекСсылка, , фВидЗапроса);
	КонецЕсли;
	// rarus tenkam 12.11.2020 mantis 16181 ---
	
	СтруктураПараметров.Вставить(Реквизит, Значение);

	//просто формируем сообщение для записи в регистр, при отправке будет формироваться повторно
	ТекстЗапроса = Scan_ВебСервисы.СформироватьСообщениеОбмена(фВидЗапроса, СтруктураПараметров, Отказ, ИмяСобытияЖурналаРегистрации);
	
	ЗаписьРегСведений = РегистрыСведений.Scan_Обмен1БДОчередьПоОтправкеРеквизитов.СоздатьМенеджерЗаписи();
	ЗаписьРегСведений.ВидЗапроса	= ВидЗапроса;
	ЗаписьРегСведений.Объект		= ТекСсылка;
	ЗаписьРегСведений.Реквизит 		= Реквизит;	
	ЗаписьРегСведений.Прочитать(); 
	
	ЗаписьРегСведений.ВидЗапроса	= ВидЗапроса;
	ЗаписьРегСведений.Объект		= ТекСсылка;
	ЗаписьРегСведений.Реквизит 		= Реквизит;
	ЗаписьРегСведений.Значение    	= Значение;	
	ЗаписьРегСведений.ТекстЗапроса  = ТекстЗапроса;	
	ЗаписьРегСведений.Пользователь 	= ТекПользователь;
	ЗаписьРегСведений.ДатаИзменения = ДатаЗаписи;

	Попытка
		ЗаписьРегСведений.Записать();				
	Исключение
		ТекстСообщения = Нстр("ru = 'Ошибка записи реквизита <'; en = 'Error recording props  <'") + Реквизит + Нстр("ru = '> для отправки в 1БД: '; en = '> to send to 1DB: '") + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
		ЗаписьЖурналаРегистрации("Регистр сведений. Очередь по отправке реквизитов в 1БД (scania)", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		Отказ = Истина;
	КонецПопытки; 
	
	Возврат;
КонецПроцедуры // ЗаписьЗначенияРегистраСведения()

//вид запроса - ссылка на перечисление виды запросов
Процедура УдалитьЗаписи(Объект, ВидЗапроса) Экспорт
	НаборЗаписей = РегистрыСведений.Scan_Обмен1БДОчередьПоОтправкеРеквизитов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Объект.Установить(Объект);
	НаборЗаписей.Отбор.ВидЗапроса.Установить(ВидЗапроса);

	Попытка
		НаборЗаписей.Записать();
	Исключение		
		ТекстСообщения = Нстр("ru = 'Не удалось удалить данные по причине:'; en = 'Unable to delete data due to:'") + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
		ЗаписьЖурналаРегистрации("Регистр сведений. Очередь по отправке реквизитов в 1БД (scania)", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		
	КонецПопытки;
КонецПроцедуры
//rarus bonmak 15.08.2019 14576 --
